CRIS67/Robot-holonome/Programmation/dsPIC/Holonome.X/main.c
/*
 * File:   main.c
 * Author: Quentin BOYER
 *
 * Created on September 18, 2017, 6:59 PM
 */

#include "constant.h"



#include <xc.h>
#include <math.h>
#include <p33EP512GM310.h>
#include <stdint.h>
#include "clock.h"
#include "GPIO.h"
#include "timer.h"
#include "PWM.h"
#include "QEI.h"
#include "PID.h"
#include "SPI.h"
#include "ADC.h"
#include "UART.h"
#include "interrupt.h"
#include "US.h"
#include "AX12.h"
#include "DMA.h"

void testAccMax();
void reglageDiametre();
void straightPath(double cx, double cy, double ct, double speedMax, double accMax);
void go(double cx, double cy, double speedMax, double accMax);
void goBack(double cx, double cy, double speedMax, double accMax);
void turn(double ct);
void turnNOLIMIT(double ct);

void modif_straightPath(double arg_cx, double arg_cy, double arg_ct, double arg_speedMax, double accMax);

void test();
void test2();
void testPWM();
void testSPI();
void testADC();
void testInterrupt();
void testDelay();

//Global variables
//char TX[TX_SIZE];
char RX[RX_SIZE];
char unsigned TX_i;
char unsigned RX_i;
/*Current position*/
volatile double x;
volatile double y;
volatile double theta;
/*Current setpoint position*/
double xc;
double yc;
double thetac;
/*Final setpoint position*/
double xf;
double yf;
double tf;

uint8_t finalPoint = 1;

volatile PID pidSpeedLeft, pidSpeedRight, pidDistance, pidAngle;
volatile PID pidSpeed0, pidSpeed1, pidSpeed2;
int state = 0;
int R,L;

volatile char arrived;
volatile char arrived_2;

extern volatile char   US_ON[NB_US];
extern volatile char   US_R[NB_US];
extern volatile double US[NB_US];

volatile char sendBT = 0;

extern volatile double receivedX,receivedY,receivedTheta;
extern volatile unsigned char newPosReceived;
extern volatile unsigned char newPosBackReceived;
extern volatile unsigned char newAngleReceived;
extern volatile unsigned char back;

extern volatile unsigned char debugPosRpi;

volatile unsigned char stop = 0;

unsigned char detectUS = 0;
unsigned char sensDetectUS = 1;

extern double var_ACC_MAX;

// <editor-fold defaultstate="collapsed" desc="Génération de trajectoire">
extern unsigned char statePathGeneration;
extern unsigned char stateTrap;

extern double cx, cy, ct;

extern double sign;

extern double phi;
extern double angle;

extern double theta0;
extern double angularVelocity;
extern double prevAngularVelocity;
extern double maxAngularVelocity;

extern double AngularAcceleration;

extern double angle1;


extern double dx;
extern double dy;
extern double alpha;

extern double totalDistance;
extern double dist;

extern double y_0;
extern double x_0;
extern double speed;
extern double precSpeed;

extern double acc;
extern double speedMax;

extern double dist1; // </editor-fold>

extern uint8_t BufferA[8];
extern volatile uint8_t RxDMABuffer[RX_DMA_SIZE];
extern uint16_t start;

extern uint16_t iD2,iF2;

volatile uint8_t verbose = 0;

volatile int16_t tick0 = 0;
volatile int16_t tick1 = 0;
volatile int16_t tick2 = 0;

int main(){
    initClock(); //Clock 140 MHz
    initGPIO();
    initPWM();
    //initQEI();
    initDMA();
    initUART();
    //initAX12();
    initInt();    
    
    initPID(&pidSpeed0,KP_SPEED_0,KI_SPEED_0,KD_SPEED_0,BIAS_SPEED_0,0,T_SPEED_0,0,0,SMOOTHING_FACTOR_SPEED_0,SATURATION_SPEED_0);
    initPID(&pidSpeed1,KP_SPEED_1,KI_SPEED_1,KD_SPEED_1,BIAS_SPEED_1,0,T_SPEED_1,0,0,SMOOTHING_FACTOR_SPEED_1,SATURATION_SPEED_1);
    initPID(&pidSpeed2,KP_SPEED_2,KI_SPEED_2,KD_SPEED_2,BIAS_SPEED_2,0,T_SPEED_2,0,0,SMOOTHING_FACTOR_SPEED_2,SATURATION_SPEED_2);

    initTimer();
    //initUS();
    initADC();
    //initSPI();
    
    
    /*
    LATBbits.LATB10 = 1;    //PWM_ASS_0
    LATGbits.LATG0 = 1;     //SENS_ASS_0
    
    LATBbits.LATB11 = 1;    //PWM_ASS_1
    LATGbits.LATG1 = 1;     //SENS_ASS_1
    
    LATBbits.LATB13 = 1;    //PWM_ASS_2
    LATGbits.LATG12 = 1;     //SENS_ASS_2
    */
    
    
    //uint16_t w = 0;
    //uint16_t w2 = 0;
    
    initPWM();
    int iLed = 0;
    while(!verbose){
        CheckMessages();
    }
    /*while(1){
        plot(1,(uint32_t)((int32_t)(tick0)));
        delay_ms(10);
        CheckMessages();
    }*/
    double iMotor = 0;
    int16_t saveTick0 = tick0;
    int16_t saveTick1 = tick1;
    int16_t saveTick2 = tick2;
    /*while(1){
        delay_ms(1000);
        sendLog("hello\n");
    }*/
    IEC0bits.T1IE = 1;
    while(1){
        setSetPoint(&pidSpeed0,1);
        setSetPoint(&pidSpeed1,1);
        setSetPoint(&pidSpeed2,1);
        delay_ms(2000);
        setSetPoint(&pidSpeed0,0);
        setSetPoint(&pidSpeed1,0);
        setSetPoint(&pidSpeed2,0);
        delay_ms(2000);
    }
    while(1){
        for(iMotor = 10; iMotor < 50; iMotor+=0.02){
            delay_ms(20);
            int32_t s0 = tick0 - saveTick0;
            int32_t s1 = tick1 - saveTick1;
            int32_t s2 = tick2 - saveTick2;
            saveTick0 = tick0;
            saveTick1 = tick1;
            saveTick2 = tick2;
            motor(0,iMotor);
            motor(1,iMotor);
            motor(2,iMotor);
            plot(1,(uint32_t)((int32_t)(iMotor*100)));
            plot(2,(uint32_t)((int32_t)(s0)));
            plot(3,(uint32_t)((int32_t)(s1)));
            plot(4,(uint32_t)((int32_t)(s2)));
            plot(5,(uint32_t)((int32_t)(PWM_0)));
        }
        sendMotor(0,0,0);
        delay_ms(2000);
        for(iMotor = 0; iMotor >-50; iMotor--){
            delay_ms(100);
            int32_t s0 = tick0 - saveTick0;
            int32_t s1 = tick1 - saveTick1;
            int32_t s2 = tick2 - saveTick2;
            saveTick0 = tick0;
            saveTick1 = tick1;
            saveTick2 = tick2;
            motor(0,iMotor);
            motor(1,iMotor);
            motor(2,iMotor);
            plot(1,(uint32_t)((int32_t)(iMotor*10)));
            plot(2,(uint32_t)((int32_t)(s0)));
            plot(3,(uint32_t)((int32_t)(s1)));
            plot(4,(uint32_t)((int32_t)(s2)));
        }
        sendMotor(0,0,0);
        delay_ms(2000);
    }
    /*while(1){
        plot(1,(uint32_t)((int32_t)(millis())));
        delay_ms(50);
    }*/
    /*for(iMotor = 0; iMotor < 100; iMotor++){
            delay_ms(20);
            int32_t s0 = tick0 - saveTick0;
            int32_t s1 = tick1 - saveTick1;
            int32_t s2 = tick2 - saveTick2;
            saveTick0 = tick0;
            saveTick1 = tick1;
            saveTick2 = tick2;
            motor(0,iMotor);
            motor(1,iMotor);
            motor(2,iMotor);
            plot(1,(uint32_t)((int32_t)(iMotor)));
            plot(2,(uint32_t)((int32_t)(s0)));
            plot(3,(uint32_t)((int32_t)(s1)));
            plot(4,(uint32_t)((int32_t)(s2)));
        }
        for(iMotor = 100; iMotor > -100; iMotor--){
            delay_ms(20);
            int32_t s0 = tick0 - saveTick0;
            int32_t s1 = tick1 - saveTick1;
            int32_t s2 = tick2 - saveTick2;
            saveTick0 = tick0;
            saveTick1 = tick1;
            saveTick2 = tick2;
            motor(0,iMotor);
            motor(1,iMotor);
            motor(2,iMotor);
            plot(1,(uint32_t)((int32_t)(iMotor)));
            plot(2,(uint32_t)((int32_t)(s0)));
            plot(3,(uint32_t)((int32_t)(s1)));
            plot(4,(uint32_t)((int32_t)(s2)));
        }
        for(iMotor = -100; iMotor < 0; iMotor++){
            delay_ms(20);
            int32_t s0 = tick0 - saveTick0;
            int32_t s1 = tick1 - saveTick1;
            int32_t s2 = tick2 - saveTick2;
            saveTick0 = tick0;
            saveTick1 = tick1;
            saveTick2 = tick2;
            motor(0,iMotor);
            motor(1,iMotor);
            motor(2,iMotor);
            plot(1,(uint32_t)((int32_t)(iMotor)));
            plot(2,(uint32_t)((int32_t)(s0)));
            plot(3,(uint32_t)((int32_t)(s1)));
            plot(4,(uint32_t)((int32_t)(s2)));
        }
    sendMotor(0,0,0);*/
    
    while(1){   /*Chenillard*/
        LATFbits.LATF5  = 0;
        LATGbits.LATG3  = 1;
        delay_ms(100);
        LATGbits.LATG3  = 0;
        LATFbits.LATF4  = 1;
        delay_ms(100);
        LATFbits.LATF4  = 0;
        LATFbits.LATF5  = 1;
        delay_ms(100);
        CheckMessages();
        //sendLog("hello there =) !\n");
    }
    
    
    while(1){
        iLed++;
        CheckMessages();
        delay_ms(10);
        if(iLed == 10){
            LATFbits.LATF5  = 0;
            LATGbits.LATG3  = 1;
        }
        if(iLed == 20){
            LATGbits.LATG3  = 0;
            LATFbits.LATF4  = 1;
        }
        if(iLed == 30){
            LATFbits.LATF4  = 0;
            LATFbits.LATF5  = 1;
            iLed = 0;
        }
    }
    
    
    
