CRIS67/Robot-holonome/Programmation/dsPIC/Holonome.X/main.c
    x = 0;
    y = 0;
    theta = 0;
    
    xc = 0;
    yc = 0;
    thetac = 0;
    
    xf = 0;
    yf = 0;
    tf = 0;
    
    TX_i = 0;
    RX_i = 0;
    
    R = 0;
    L = 0;
    

    
    /*POS1CNTL = 0x8000;
    POS2CNTL = 0x8000;*/
    POS1CNTL = 0x0000;
    POS2CNTL = 0x0000;
    
    //initAllPID(&pidSpeedLeft, &pidSpeedRight, &pidDistance, &pidAngle);
    initTimer();
    state = 1;
    
    stop = 0;

    int m,p = 0;
    p++;
    /*x = 1000;
    y = 1500;
    theta = PI*/
    
    x = 0;
    y = 0;
    theta = 0;
    
    xc = x;
    yc = y;
    thetac = theta;
    
    xf = x;
    yf = y;
    tf = theta;
    /*for(p = 0; p <= 6; p++)
        servoUs(p,0);*/
    verbose = 0;
    
    //uint32_t foo = 0;
    
    //TRISFbits.TRISF7 = 0;
    //uint16_t iDelay,jDelay;
    //LATFbits.LATF7 = 1;
    
    delay_ms(2000);
    while(1){
        xc = 500;
        CheckMessages();
        delay_ms(1000);
        xc = 0;
        CheckMessages();
        delay_ms(1000);
        xc = -500;
        CheckMessages();
        delay_ms(1000);
        xc = 0;
        CheckMessages();
        delay_ms(1000);
    }
    
    while(1){
        sendLog("x = ");
        sendLog(dtoa(x));
        sendLog(" | y = ");
        sendLog(dtoa(y));
        sendLog(" | t = ");
        sendLog(dtoa(theta*180/PI));
        sendLog("\n");
        sendPos();
        
        CheckMessages();
        delay_ms(500);
    }
    while(1){
        //uint16_t dummy = SPI2BUF;
        sendLog("0x20 (debug) sent to ComeCard\n");
        SPI2BUF = 0x20; //debug
        delay_ms(500);
        //dummy = SPI2BUF;
        //CheckMessages();
        //sendLog(itoa(dummy));
        sendLog("0x21 (autre) sent to ComeCard\n");
        SPI2BUF = 0x21; //autre
        delay_ms(500);
        //dummy = SPI2BUF;
        CheckMessages();
        //sendLog(itoa(dummy));
    }
    while(1){
        /*for(p = 10; p < 50; p++){
            plot(p,100);
            delay_ms(10);
        }*/
        /*plot(1,(uint32_t)(int32_t)(thetac*1000));
        //plot(2,(uint32_t)(int32_t)(angularVelocity*1000));
        //plot(3,(uint32_t)(int32_t)(angle*1000));
        plot(4,(uint32_t)(int32_t)(theta*1000));
        plot(5,(uint32_t)(int32_t)(pidAngle.setPoint*1000));*/
        CheckMessages();
        //if(!stop){
            delay_ms(10);
            //plot(1,micros());
            sendPos();
            sendRupt();
            sendUS();
            /*plot(1,iF2);
            plot(2,iD2);*/
            m++;
            if(m >= 10){
                m = 0;
                //sendLog("m overflow\n");
            }
            //send("timing\n",strlen("timing\n"));
            if(newPosReceived){
                statePathGeneration = 42;
                delay_ms(100);
                newPosReceived = 0;
                if(newPosBackReceived)
                {
                    newPosBackReceived = 0;
                    //printRpi(("DEBUG goBack main 1\n"));
                    goBack(receivedX,receivedY,2000,200);
                    //printRpi(("DEBUG goBack main 2\n"));
                }
                else{
                    //go(receivedX,receivedY,2000,200);
                    //go(receivedX,receivedY,1000,100);
                    modif_straightPath(receivedX,receivedY,0,1000,100);
                }
            }
            if(newAngleReceived){
                newAngleReceived = 0;
                turn(receivedTheta);
            }
            /*if(statePathGeneration){
                plot(1,(uint32)(int32)(((thetac*3600)/(2*PI))));
                plot(2,(uint32)(int32)(((angularVelocity*3600)/(2*PI))));
                plot(3,(uint32)(int32)(((theta*3600)/(2*PI))));
            }*/
        //}
        
    }

    /*while(1){
        if(stop){
            //IEC0bits.T1IE = 0;  //stop asserv
            sendToMotor(0,0);   //stop motors
            while(stop){        //wait for start signal
            }
            //IEC0bits.T1IE = 1;  //restart asserv
        }
        switch(state){
            case 0: //init
                IEC0bits.T1IE = 0;
                x = 0;
                y = 0;
                theta = 0;
                xc = 0;
                yc = 0;
                thetac = 0;
                xf = 0;
                yf = 0;
                tf = 0;
                POS1CNTL = 0x8000;
                POS2CNTL = 0x8000;
                IEC0bits.T1IE = 1;
                delay_ms(1000);
                state++;
                break;
            case 1 :
                if(newPosReceived){
                    newPosReceived = 0;
                    if(newPosBackReceived)
                    {
                        newPosBackReceived = 0;
                        //printRpi(("DEBUG goBack main 1\n"));
                        goBack(receivedX,receivedY,2000,200);
                        //printRpi(("DEBUG goBack main 2\n"));
                    }
                    else
                        //go(receivedX,receivedY,2000,200);
                        modif_straightPath(receivedX,receivedY,0,1000,1000);
                }
                if(newAngleReceived){
                    newAngleReceived = 0;
                    turn(receivedTheta);
                }
                delay_ms(100);
                break;
            default:
                sendLog("ERROR UNDEFINED STATE");
                break;       
        }
       
    }*/
    return 0;
}

void testAccMax(){
    double commandeL = 12;
    double prevCommandeL = 0;
    double delta = 0.1;
    double newCL;
    while(1){
        if(commandeL - prevCommandeL > delta)
            newCL = prevCommandeL + delta;
        else if(commandeL - prevCommandeL < -delta)
            newCL = prevCommandeL - delta;
        else
            newCL = commandeL;
        prevCommandeL = newCL;
        //sendToMotor(0,newCL);
        delay_ms(30);
    }
}
void reglageDiametre(){
    IEC0bits.T1IE = 0;
    POS1CNTL = 0x8000;
    POS2CNTL = 0x8000;
    double l,r,l2,r2;
    double D1,D2;
    while(1){
        l = (double)(POS1CNTL - 0x8000) * PI * 2 * ENCODER_WHEEL_RADIUS / 4096;
        r = (POS2CNTL - 0x8000) * PI * 2 * ENCODER_WHEEL_RADIUS / 4096;
        l2 = (double)(POS1CNTL - 0x8000) * PI * 2 / 4096;
        r2 = (double)(POS2CNTL - 0x8000) * PI * 2 / 4096;
        D1 = 300/l2;
        D2 = 300/r2;
        
        /*print("l : ");
        print(itoa((int)l));
        print("      r : ");
        print(itoa((int)r));
        print("      D1 : ");
        print(itoa((int)(D1)));
        print("      D1*100 : ");
        print(itoa((int)(D1*100)));
        print("      D2 : ");
        print(itoa((int)(D2)));
        print("      D2*100 : ");
        print(itoa((int)(D2*100)));
       
